Revit 2026 API

# MassSurfaceDataIsGlazingShaded Property

---

Indicates if shade geometry is auto-generated on the top edge of auto-generated glazing.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsGlazingShaded { get; set; }
```
```vb
Public Property IsGlazingShaded As Boolean
	Get
	Set
```
```cpp
public:
property bool IsGlazingShaded {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsGlazingShaded : bool with get, set
```

#### Property Value

Boolean

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace